loadTest/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
  processor: "./worker.js"

scenarios:
  - name: "something"
    flow:
      - loop:
        - function: "generateUrl"
        - get:
            url: "/reviews/{{listing}}"
        # - log: "sent request to {{listing}}"
        count: 500